{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Aditya Prakash Blog",
    "description": "",
    "home_page_url": "https://prakash-aditya.github.io/my-blog",
    "feed_url": "https://prakash-aditya.github.io/my-blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Aditya Prakash"
    },
    "items": [
        {
            "id": "https://prakash-aditya.github.io/my-blog/bolo-zubaan-se-sorry/",
            "url": "https://prakash-aditya.github.io/my-blog/bolo-zubaan-se-sorry/",
            "title": "Bolo Zubaan se Sorry!",
            "summary": "Context Recently bollywood actor Akshay Kumar started appearing in a Vimal ad with two other actors. The indian audience filled&hellip;",
            "content_html": "<h4 id=\"context\">Context</h4>\n<p>Recently bollywood actor Akshay Kumar started appearing in a Vimal ad with two other actors. \nThe indian audience filled the social media with memes.</p><blockquote>\n<p>Herogiri foo foo karne mein nahi, thoo thoo karne mein hai.</p></blockquote>\n<p>Older videos of Akshay kumar boasting that many companies come to him with unimaginable amounts to do some ads but he would never do anything that impacts the health of people. \nObviously the clip ended with a short clip from the recent Ad (Bolo Zubaan kesari).</p><p>This went on so much so that Akshay Kumar issued an apology to his fans about doing it and promised to be careful from now on while taking endorsements. </p><hr>\n<h4 id=\"possible-psychology-of-pitfall\">Possible psychology of pitfall</h4>\n<p><strong>1. You are the easiest person to be fooled by yourself</strong></p><p>When it comes to fooling yourself, it is very easy to do so. \nWhen Akshay signed the contract, it must have seemed to him that he was not doing anything wrong in endorsing Vimal Elaichi.</p><p><strong>2. Money makes you weak in proportion to amount offered</strong></p><p>It is even easier to fool yourself when a huge amount of money is offered. These offers outweigh any negatives you had in your mind. </p><hr>\n<h4 id=\"issue\">Issue</h4>\n<p><strong>I highly appreciate Akshay Kumar’s gesture of apologizing and I think it was a very brave decision.</strong></p><p>Although he apologized, he sneaked in the info that he was not intending any harm to anyone and was only doing the ad for Elaichi and not the paan masaala. \nThe same logic has been given by Ajay Devgn earlier and even now when asked after Akshay’s apology.</p><h4 id=\"debunking-the-logic\">Debunking the logic</h4>\n<p>I dont think that he had no idea of existence of Vimal Paan Masaala. \nI think it is the Vimal Paan Masala division that is sponsoring the Ads on behalf of the Elaichi (if they are separate divisions) with three so called Bollywood Superstars, because I don’t think the botton line (profit)\nof Vimal Elaichi could sponsor those three. If I can see this then Obviously they must know this, or at least their team must be capable of this research, if needed. Even then they thought that they are not endoring paan masaala, and what’s wrong in endorsing Elaichi!</p><p>This type of Ad will profit the Vimal Paan Masaala more than the Elaichi. So, one could not be free from the moral obligation just by mentioning that they are doing the Elaichi Ad, not the paan masaala one.</p><h4 id=\"solution\">Solution</h4>\n<p>Watching the ads affects your subconscious.\nEven if you consciously know that it is just an ad and it might or might not be true - mostly not true. \nEven then due to the impressions on your subconscious mind, you tend to choose this when given option. </p><h5 id=\"controlled-ads-impossible\">Controlled Ads (impossible)</h5>\n<p>It would be great if I could control what ads I’ll not see. I could turn the ads off for companies I don’t want to see ads for.</p><p>But this will never be possible because companies pay higher ad fee to platforms to forcibly show their ads to people. Consider non-skippable ads on youtube.\nControlled ads would lower the revenue for the showing platforms, hence lower possibility for its implementation.</p><h5 id=\"associate-negative-image-possible\">Associate negative image (possible)</h5>\n<p>This will require training your own brain to ignore the importance of those ads. This can be achieved by lowering the importance of the celebrities involved in these types of ads.</p><p>You could Associate a negative image to that celebrity whenever you see that ad you didn’t want to see. Recall the same image whenever you see that celebrity in a film or whatever their work, recall that they have been doing\nunwanted ads just for money and not caring about the well being of the countrymen. </p><p>Doing this will lower their importance in your mind and your subconscious wont see that person as someone important or Hero.\nWhen this starts happening in some time of practice, you’ll see that ads wont affect you.</p><h5 id=\"notice-the-details-possible-and-interesting\">Notice the details (possible and interesting)</h5>\n<p>Look into the ads as if they have been crafted just  to impress you. Pay attention to the details. \nSee how shiny the things in the ad are. Notice how modulating the voice is. Notice they have put music piece in the background just to delude your mind in thinking that this is an interesting thing.</p><p>When you train your mind for these things, you’ll see you start to enjoy the ads too, and that too without letting them get into your brain. </p><hr>\n<hr>\n<p>For any feedback or further discussions, please reach out to me on <a href=\"https://www.linkedin.com/in/prakash-aditya/\">LinkedIn</a> or <a href=\"mailto:&#109;&#x61;&#105;&#x6c;&#64;&#x61;&#100;&#105;&#x74;&#121;&#97;&#45;&#112;&#x72;&#x61;&#x6b;&#x61;&#115;&#104;&#46;&#99;&#111;&#x6d;\">&#109;&#x61;&#105;&#x6c;&#64;&#x61;&#100;&#105;&#x74;&#121;&#97;&#45;&#112;&#x72;&#x61;&#x6b;&#x61;&#115;&#104;&#46;&#99;&#111;&#x6d;</a>  </p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2022-04-23T22:35:00+05:30",
            "date_modified": "2024-10-06T02:37:58+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/certificates-are-worthless/",
            "url": "https://prakash-aditya.github.io/my-blog/certificates-are-worthless/",
            "title": "Certificates are Worthless",
            "summary": "I wrote this blog to justify my post on linkedIn. It reads: Certificates are worthless. I say that again: worthless!&hellip;",
            "content_html": "<p>I wrote this blog to justify my post on linkedIn. \nIt reads: </p><p><em>Certificates are worthless. I say that again: worthless!\nIf you want to do any course, think whether you would still do that if there was no certificate. If yes, then go ahead otherwise there is no point doing that.\nAnd after the completion instead of posting your certificate post something you built during the course. That’ll be worth much more.\nHappy learning!</em> 😃</p><p>I thought I’ll write down the reasons for my view. So here they are:</p><h4 id=\"measure-of-learning\">Measure of learning?</h4>\n<p>Some people think that its a measure of their learning. But I think the real measure of learning would be to apply that skill you learnt and create something which you can show to people instead of the certificate. I bet you It’ll give you much more confidence than the certificate and others also have an idea about what really you know, thus accomplishing the measurement of the skillset.</p><h4 id=\"opens-opportunities\">Opens opportunities?</h4>\n<p>Some people think that it helps them land good opportunities. I think most of the employers are now shifting towards giving priority to the skillset rather that the degree or certifications taken by the student. If people would think that certificates have some worth, there would be no  tests/interviews whatsoever for any job. You would just had to provide certificates and get offer letter. haha. </p><p>But I think I’d be lying if I say employers don’t look upon the certification section in your resume. But what I’m trying to say is only the certificate wont give you the job.</p><p>Now even if you are given an opportunity based on your certification, then also it’d be hell for you in the real job if you had somehow passed/finished the course to get the certificate. Only skill can take you forward. Also I dont think there would be an employer who would ask for your certificate rather than your work which would give the real measure of your skill.</p><h4 id=\"the-real-issue\">The Real issue</h4>\n<p>There one more side to it. There are some people starting certification programs just for the sake of certification. And also there are some people who enroll in these programs just for the sake of certifications. They do it because they think there is some value in the certificates. And it is true to some extent. So they take the certificate and after some time realise that it had no value. </p><h4 id=\"the-solution\">The Solution</h4>\n<p>This will keep happening until we don’t start looking down upon the certficates and looking up to the efforts put in the projects, however little it be.</p><p>This is my personal view  but we need to discuss this as a community and try to reach a good solution for the issue (if it is really a issue 😃). So I thought I’d give it a little push. </p><h1 id=\"\"></h1>\n<h1 id=\"-1\"></h1>\n<p>At the end I’d like to point out that I too have a certificate (which I spent 4 years to get. yeah, my degree!😃) in Electronics and Communicatin Engineering but I don’t think I deserved that, given my skills in the field.</p><p>Also if you have any views please reach out to me on <a href=\"https://www.linkedin.com/in/prakash-aditya/\">LinkedIn</a> or send me a mail at <a href=\"mailto:&#x6d;&#x61;&#x69;&#x6c;&#x40;&#97;&#x64;&#105;&#116;&#121;&#x61;&#x2d;&#112;&#x72;&#97;&#107;&#97;&#x73;&#104;&#x2e;&#99;&#111;&#109;\">&#x6d;&#x61;&#x69;&#x6c;&#x40;&#97;&#x64;&#105;&#116;&#121;&#x61;&#x2d;&#112;&#x72;&#97;&#107;&#97;&#x73;&#104;&#x2e;&#99;&#111;&#109;</a>  </p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2021-06-08T16:44:00+05:30",
            "date_modified": "2024-10-06T15:12:36+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/dealing-in-infinities/",
            "url": "https://prakash-aditya.github.io/my-blog/dealing-in-infinities/",
            "title": "Dealing in Infinities",
            "summary": "ॐ पूर्णमदः पूर्णमिदं पूर्णात् पूर्णमुदच्यते। पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते॥ That is complete, This is complete, from (that) complete emerges (this) complete.",
            "content_html": "<p><em>ॐ पूर्णमदः पूर्णमिदं पूर्णात् पूर्णमुदच्यते। पूर्णस्य पूर्णमादाय पूर्णमेवावशिष्यते॥</em></p><p><em>That is complete, This is complete, from (that) complete emerges (this) complete. On separation of (this) complete from (that) complete, complete only remains.</em></p><p>This is from  वृहदारण्यक उपनिषद (vrihadaaranyak upanishad). In this context, I think, ‘that’ refers to God and ‘this’ refers to us. Let us not go into that. Just look at the logic here. I used to wonder how can this be. How on removing something from something complete can leave it complete? </p><p>Yesterday, I was going through George Gamaw’s ‘One Two Three … Infinity’. In there he has explained how to deal with infinities and how to compare them. There he has concluded that: </p><p><em>In the world of infinity, a part may be equal to the whole!</em></p><p>This may seem illogical to you same way the ‘mantra’ is sounding illogical. But let us delve into logic here. </p><p>Many Hottentot tribes in Africa do not have names for numbers larger than three (According to Gamaw’s book). If they have to refer to a number greater than three, they use a word like “many” in their language. Now if they want to know which of them in their neighborhood has more children, can they do that? </p><p>Let’s say there are two Hottentots who has 7 and 10 children respectively. They do not know how to count beyond 3. How will they compare? If they are intelligent they can get the answer by comparing them one by one. They will place one child of one with the one child of other and another child of one with another child of another and so on. They will know who has more child when some children of anyone remains after pairing with children of the others.</p><p>In a similar way, while dealing with the infinities, we become analogous to the Hottentots. So for comparing infinities we should proceed in the similar fashion, i.e. by comparing the individual items. </p><p>Let us have an example for this. </p><p>We know that the total number of integers is infinite. We also know that total number of even numbers is also infinite. Now, if I ask you which among these two infinities is larger then your impression would be that the even numbers’ infinity is smaller and that of integers is larger. But let’s not go with the impression and follow the process here. </p><p>We have to compare the elements one by one. Lets do that. Here I am mapping integers to the corresponding even number.</p><p>1 : 2, 2 : 4, 3 : 6, 4 : 8, 5 : 10, 6 : 12, … , 101 : 202, … , 1012 : 2024, …</p><p>This can go on and on and on. So for every integer we have an even number. Thus we must conclude that both the infinities are equal, even if this goes against our impressions. It is because the properties of the infinity is different than normal.</p><p>This is what I understood in the book and it immediately connected the dots for me. I instantly remembered this verse which mean almost the same thing. Maybe it suggests that we too are infinite. Maybe it suggests we are whole on our own. Maybe it suggests Everyone is as complete as God himself. I don’t know. Maybe.</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-08-07T17:47:00+05:30",
            "date_modified": "2024-10-06T02:37:16+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/words/",
            "url": "https://prakash-aditya.github.io/my-blog/words/",
            "title": "Words",
            "summary": "When during a discussion about something, someone said, “भावनाओं को समझो, शब्दों में क्या रखा है?”, a thought automatically came&hellip;",
            "content_html": "<p>When during a discussion about something, someone said, “भावनाओं को समझो, शब्दों में क्या रखा है?”, a thought automatically came from within that the words are important too, apart from the emotions behind it. I formatted those thoughts into this.</p><pre><code>                    “शब्द”  \n</code></pre>\n<p>शब्दों से हीं झगड़े होते, शब्दों से सत्कार;</p><p>शब्दों से ही ऊपर आते मन के सब उद्गार।</p><p>शब्दों से हीं खुशियाँ होती, शब्दों से त्योहार;</p><p>शब्दों बिन हो जाएंगे सब जीवन-रस बेकार।</p><p>शब्दों से हीं बातें होती, शब्दों से इज़हार;</p><p>शब्दों से हीं पूरा होता है आँखों का प्यार।</p><p>शब्दों से हीं माँगे जाते अपने हक अधिकार;</p><p>शब्दों के हीं पेंचों से बदली जाती सरकार।</p><p>शब्दों से आशीष भी है, शब्दों से है धिक्कार;</p><p>शब्दों से हीं रिश्तों में आ जाती बड़ी दरार।</p><p>शब्दों की तलवारों से भी पैनी होती धार;</p><p>मुश्किल होता है शब्दों का खाली जाना वार।</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-06-13T11:24:00+05:30",
            "date_modified": "2024-10-06T02:36:54+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/engineering-vacation-over/",
            "url": "https://prakash-aditya.github.io/my-blog/engineering-vacation-over/",
            "title": "Engineering vacation over",
            "summary": "I had been introduced to competition very early in my life. I had to prepare for the entrance exam of&hellip;",
            "content_html": "<p>I had been introduced to competition very early in my life. I had to prepare for the entrance exam of Ramakrishna Mission Vidyapith for class 6. In Muzaffarpur, where I  prepared for that competition in the coaching(yes, there are coachings for preparation of entrance examinations of various schools such as Military School, Sainik Schools, Navoday Vidyalaya , R K Mission, etc), these examinations are taken quite seriously. </p><p>My teachers, in order to motivate us, used to say, “Work hard for a few months, and then after the selection, your life is set!”. </p><p>They lied, I believed. </p><p>I cracked that exam and was admitted to RK Mission vidyapith deoghar. Life was still not set. The same life went on. Same classes, same exams, same expectations of better results.\nAnyhow, I came to class 10th. My parents said, “This is where your real test is. It will show what you have studied in these 10 years. Work hard and get good results now. Life will be great.” </p><p>They lied, I believed.</p><p>I got 10 CGPA in 10th and everybody was happy for some days as long as people kept asking my 10th board results. Life was normal afterward.\nI went to class 11th. Now I was told - “Work hard these two years, these results will be with you your lifetime.” I remember my Mamaji saying after my 10th result, “This is not the actual exam. The real exam is in 12th”. Everyone said, “Just get a good result in 12th and your life is set!”. </p><p>They lied, I believed.</p><p>I got 95.6% in 12th board. Then I went to Kota for JEE preparation. Everyone went real crazy this time, “This is the most important year in your life. This one year of preparation will make you or break you. This is the exam that can make your life.” I was now slowly recognizing the pattern here. </p><p>Still, they lied, I believed. </p><p>I got admitted to the National Institute of Technology, Jamshedpur. You can predict here, not so hard work was done. When I entered college, my subconscious might have known that probably this is the great life everyone was pointing to. I began to enjoy. No attention to any classes. Just doing what I felt like. Bunking classes. You won’t believe, I got 2 marks out of 20 in maths in T1(our first examination there). Anyhow, I got 7.76 CGPA in my first semester.</p><p>My parents kept reminding me that these four years are the most important years of my life and I should work hard as they will decide my whole life after college. I assured them that I was working very hard. </p><p>This time, I lied, they believed.</p><p>In the 3rd semester, I just passed in Mathematics, a subject which I used to love. I used to study only days before exams. One thing I did really well was to study programming because I liked it. I love computer science, but could not get into that department due to insufficient JEE rank.\nAnyhow, these four years have passed, quite easily and I did what I wished, literally! Now, I have a Software Engineering job and this vacation is about to end.</p><p>One thing that I have learned from this whole process is that ‘the set life’ is never going to come at any specific point in your life. You shall have to keep looking and keep moving towards it. But, it is not that you should not work hard. You should labor hard for the sake of work. Not keeping in mind that your life will be easier afterward.</p><p>You need to find easiness in your lifestyle with work. Because Life is Labour, Death only is rest.</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-05-31T11:14:00+05:30",
            "date_modified": "2024-10-06T02:37:12+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/manufacture-ideas/",
            "url": "https://prakash-aditya.github.io/my-blog/manufacture-ideas/",
            "title": "Manufacture Ideas",
            "summary": "Some time ago, I used to go restless when I had nothing to do. I used to check facebook timeline,&hellip;",
            "content_html": "<p>Some time ago, I used to go restless when I had nothing to do. I used to check facebook timeline, instagram feed, whatsapp messeges, then the statuses of all these platforms, then again its feeds, then some youtube and this would go on. I wanted to consume as much as I could. </p><p>Then my phone broke and I had to live without a smartphone for a few weeks. I had nothing to do in my free time except sitting idle and thinking about myriad of things. I would just sit and let my mind wander. Then to my surprise ideas started coming to me. Varieties to them. Of every kind. From those experiences I derived a process (sort of), which I am sharing with you.</p><p>The first thing you need to believe is that your mind has unlimited possibility for generation of ideas. If you believe it then anything is possible from here. The process which I apply for idea generation is quiet simple. And to be clear about myself, I have not applied this technique to generate ideas related to any specific topic, but rather a general idea, just regarding anything under the sun. </p><p>Let’s talk about the process itself. Clear off any unfinished work and then sit in a quiet place. You do not need to have any noting materials nearby. Just sit empty handed. And clear your head. Just clear it. Think Nothing. </p><p>Human mind is pretty restless mind. It’s attention span is nearly 7 seconds.  Your mind does not like to sit idle. It likes to jump around and it will prevent you from focusing it by going to unimaginable limits. When you try to clear your mind and focus on only one thing, it will feed you some random stuffs to distract you from focusing. Beware now! If you are baited then it is over. But if you persist then the game goes on. It will throw into your attention some interesting thing or idea. It goes on like this. The longer you persist the more interesting things your mind will hunt for you. And everything is in your mind, you should believe it. </p><p>My only advise to you is that do not get carried away with the initial offerings of your brain. It has brilliant stuffs buried deep within it. You just need to irritate it enough by (ironically) calming it so that it reveals its secrets.</p><p>This process works for me most of the time. But even if it does not work, my mind is more calm than before and I can now focus on things a bit longer. I have nothing to lose and plenty to gain from this process.</p><p>Fun Fact: I got the idea that this activity can be a ‘Idea Manufacturing’ process during one of these mind hunts itself. </p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-05-26T11:18:00+05:30",
            "date_modified": "2024-10-06T02:37:07+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/the-attendance-illusion/",
            "url": "https://prakash-aditya.github.io/my-blog/the-attendance-illusion/",
            "title": "The Attendance Illusion",
            "summary": "I will soon be graduated. It is not the result only of my personal effort. It is the result of&hellip;",
            "content_html": "<p>I will soon be graduated. It is not the result only of my personal effort. It is the result of the combined efforts of many, the least of which is of my professors. Their only contribution to my degree is that they evaluated my answer sheets, took my attendance, and kept reminding every now and then that one with short attendance will be facing consequences. </p><p>The attendance system is there to force the students to attend the classes. It is in place to prevent casual bunking of classes by students. But this is at a greater cost, which we are failing to realize (or admit). Why are we forced to sit in a class which does not interest us at all? Is it just because I opted for that branch of study? I did not know that these subjects would seem so boring back then when I had applied. Now that I am on the verge of exiting the education system here, It seems to me that the subjects are not boring themselves. No subject can be boring. </p><p><em>If you find science boring, you are learning it from a wrong teacher. - Richard Feynman</em></p><p>And things become worse when you force someone to sit through the boring times. From this boredom comes the hatred for the subject. After this, it will be very hard for his interest in the subject to grow (even by any Good teacher). </p><p>Except if some discussion has to be held in the class, it is utter nonsense to force the student to sit just to listen to the teacher. Especially in this tech-era where even the teachers know that lectures better than theirs are available online. The students should be free to use the materials online or attend the lectures of his teacher, whichever fits them most, and take the help of the teachers to clarify any doubt. This way, even the teachers would elevate their standards, who at present don’t give a damn about the teaching methodology as they know the students will anyway attend.  Accepting this attendance system is same as accepting mediocrity. </p><p>The biggest misunderstanding of the implementers of the ‘Minimum required attendance percentage’ must be that the students who attend the class study during that time and the students who do not attend the class do not study. While this system has managed to satisfy almost everyone that Education is happening, all it has really done is to prepare and nurture students who study only for the sake of examinations and then forget everything after the exams are over.</p><p>This system definitely needs to change and it will change gradually as more and more students are being churned out of this culprit factory who will soon realize that they had been wasting their time all along attending those lectures.</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-05-23T09:31:00+05:30",
            "date_modified": "2024-10-06T02:37:00+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/reorganization-of-education/",
            "url": "https://prakash-aditya.github.io/my-blog/reorganization-of-education/",
            "title": "Reorganization of Education",
            "summary": "Today morning from 09:30 to 10:30 was my examination of the subject ‘Digital Image Processing’. Yesterday when I was studying&hellip;",
            "content_html": "<p>Today morning from 09:30 to 10:30 was my examination of the subject ‘Digital Image Processing’.</p><p>Yesterday when I was studying for today’s test, upon seeing the ‘j’, denoting complex values (which I had learned in my senior secondary days as ‘i’), I remembered what a friend of mine, who took biology in class 11th, asked me a few weeks back.</p><p>He had asked, “Hey, you guys (who took mathematics then) used to study that thing with i (he meant complex numbers) and dy/dx and so many things. Are they of any use now? I don’t think those things have any practical application.” I had a very hard time trying to explain to him that all those things are very integral parts of engineering and that engineering is more that what he meant by ‘practical application’. Back then in class 11th, he had to learn a little bit of calculus for his Physics classes, and he did not like this at all.</p><p>The problem was that he had no idea of any application of what he was learning. Of course, the immediate application of differentiation was to calculate the acceleration of a particle with the given function of its velocity, but to him this was not a practical example. Why and where the hell in my life will I get this function of velocity, he would say. He might have needed to know some scenarios where those things would be useful for him, and frankly, there were none!</p><p>This I think is the biggest problem in education today. We are providing abstract education to the students. They know what they are studying but a very tiny fraction of them knows why they are studying it. This is the ‘Bottom-up’ approach to teaching. Here the students miss the forest for the tree. They spend a lot of time on the subjects which they will probably never use in their life (like my biology friend). Even if he gets a related problem it will not be worth what he went through studying them in detail. And when he really gets the problem it will be much easier for him to learn then, as he will have a clear picture of what he wants and how the process and steps are helping him gradually solve his problem.</p><p>What I am proposing is a somewhat top-down approach where we show the students what is desired and then show them the steps to go there and then describe the steps in detail. An even better situation is when the student encounters a problem and then starts to study its solution and take the help of the experts to learn the steps involved. This process will save a huge amount of time wasted in learning things unnecessary to us which we soon forget.</p><p>Calculate the time it took you to go through those secondary year school and senior secondary and then graduation, then post-graduation, and so on. If any person wants to study all which you remember now, don’t you think that it will take much less time than you? And why will he even care to do so? He does not need all of that, same as you do not need all of that.</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-05-21T11:22:00+05:30",
            "date_modified": "2024-10-06T02:37:03+05:30"
        },
        {
            "id": "https://prakash-aditya.github.io/my-blog/concept-of-touch/",
            "url": "https://prakash-aditya.github.io/my-blog/concept-of-touch/",
            "title": "Concept of Touch",
            "summary": "Ever touched anything? Felt its texture? Maybe your mind formed an impression of the texture of the subject while you&hellip;",
            "content_html": "<p>Ever touched anything? Felt its texture? Maybe your mind formed an impression of the texture of the subject while you were “feeling” it, but, if by ‘touching’ you mean having contact of your fingers with the other object, then, you are mistaken. You did not touch it. In fact you have never touched anything in your whole lifetime. This might come to you as a shock, but, give it some time and think about it.</p><p>Two atoms never touch each other, except when they are chemically bonded. There is high electrostatic repulsion when two atoms come close together. This force is inversely proportional to the distance between them(squared). Thus, if they approach each other then the distance between them decreases and the repulsion increases. In chemical reactions, nuclear force comes into play and it neutralizes or overcomes the repulsion. Otherwise when the distance tends to zero(total touch), the repulsion reaches infinity.</p><p>Thus, a pure physical touch is not feasible. What is possible is merely a sensation of contact due to detected pressure from that object.</p><p>Enjoy a somewhat changed mind!</p>",
            "author": {
                "name": "Aditya Prakash"
            },
            "tags": [
            ],
            "date_published": "2020-05-19T10:40:00+05:30",
            "date_modified": "2024-10-06T02:38:06+05:30"
        }
    ]
}
